transonic-dlrbuffet-hisa-viscous/setups.orig/kEpsilonPhitF/0.orig/back/h
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      h;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    INLET
    {
        type calculated;
        value $internalField;
    }

    row_1_PER1
    {
        type            cyclic;
    }
    row_1_PER2
    {
        type            cyclic;
    }
    OUTLET
    {
        type zeroGradient;
    }
    Blade
    {
        type            fixedValue;
        value           uniform  0.11;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}

// ************************************************************************* //
